app/controllers/domains_controller.rb

  def index
    @domains = Domain.all
---
SELECT "domains".* FROM "domains"

  def show
    @datas = DomainData.where(:domain_id => @domain.id )
---
SELECT "domain_data".* FROM "domain_data" WHERE "domain_data"."domain_id" = ?  [["domain_id", 51]]

  def new
    @domain = Domain.new
    @scholarships = Scholarship.all
    @periods = Period.where(:activ => true)
---
SELECT "scholarships".* FROM "scholarships"
SELECT  "periods".* FROM "periods" WHERE "periods"."activ" = ? LIMIT 1  [["activ", "t"]]

  def create
    @scholarships = Scholarship.all
    @domain = Domain.new(domain_params)
    @periods = Period.where(:activ => true)

    domain_data = params[:domain_data]

    respond_to do |format|
      if @domain.save
---
SELECT "scholarships".* FROM "scholarships"
SELECT "periods".* FROM "periods" WHERE "periods"."activ" = 't'
INSERT INTO "domains" ("name", "money", "scholarship_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "perf_mate"], ["money", 450.0], ["scholarship_id", 1], ["created_at", "2015-03-08 16:37:59.995143"], ["updated_at", "2015-03-08 16:37:59.995143"]]

    def set_domain
      @domain = Domain.find(params[:id])
---
SELECT  "domains".* FROM "domains" WHERE "domains"."id" = ? LIMIT 1  [["id", 51]]