app/controllers/home_controller.rb

SELECT "domains".* FROM "domains"  ORDER BY "domains"."order_number" DESC
---
  def generate
    @domains = Domain.order(order_number: :desc)