app/controllers/news_controller.rb

  def create
    @news = News.new()
    @news.title = news_params["title"]
    @news.content = news_params["content"]
    @news.post_date = Time.now
    @news.user_id = @current_user.id

    username = @current_user.last_name

    @students = JSON.parse RestClient.get "http://193.226.51.30/get_students?oauth_token=#{@current_user.token}", {:accept => :json}
      # incerc sa prelucrez studentii si sa scot emailurile intr-un array
      @mailing_list = Array.new
      @students.each do |year|
        year[1].each do |cycle|
          cycle[1].each do |group|
            group[1].each do |student|
             @mailing_list << student["email"]
---
SELECT  "users".* FROM "users"  WHERE "users"."uid" = '86' LIMIT 1
INSERT INTO "news" ("title", "content", "post_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @news.destroy
---
DELETE FROM "news" WHERE "news"."id" = ?  [["id", 7]]

    def set_news
      @news = News.find(params[:id])
---
SELECT  "news".* FROM "news"  WHERE "news"."id" = ? LIMIT 1  [["id", 1]]