app/controllers/periods_controller.rb

  def index
    @periods = Period.all
    @all_scholarships = Array.new
    @periods.each do |p|
      @all_scholarships << {"sesiune" => p, "burse" => Domain.where(:period_id => p.id)}
---
SELECT "periods".* FROM "periods"
SELECT "domains".* FROM "domains" WHERE "domains"."period_id" = ?  [["period_id", 3]]

  def create
    @period = Period.new(period_params)

    if @period.start < @period.end
        respond_to do |format|
          if @period.save
            # create a news when a period is started
            @news = News.new()
            @news.title = "Sesiune noua de burse"
            @news.content = "A fost deschisa o sesiune noua de aplicare la burse. Perioada incepe la #{@period.start} si se termina la #{@period.end}"
            @news.post_date = Time.now
            @news.published = true
            @news.user_id = @current_user.id

            username = @current_user.last_name
            @mailing_list = Array.new

            @students = JSON.parse RestClient.get "http://193.226.51.30/get_students?oauth_token=#{@current_user.token}", {:accept => :json}
---
INSERT INTO "news" ("title", "content", "post_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "periods" ("buget", "activ", "nr_stud", "min_salary", "start", "end", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "86"]]

  def destroy
    @period.destroy
---
DELETE FROM "periods" WHERE "periods"."id" = ?  [["id", 1]]

    def set_period
      @period = Period.find(params[:id])
---
SELECT  "periods".* FROM "periods" WHERE "periods"."id" = ? LIMIT 1  [["id", 3]]