app/controllers/scholarships_controller.rb

SELECT "scholarships".* FROM "scholarships"
---
  def index
    @scholarships = Scholarship.all