app/controllers/user_sessions_controller.rb

  def create
    omniauth = env['omniauth.auth']

    user = User.find_by_uid(omniauth['uid'])
    if not user
      if omniauth['extra']['student'] == 'true'
        session[:first_auth] = true
      end

      user = User.new(:uid => omniauth['uid'])
    else
      session[:first_auth] = false
    end

    user.first_name = omniauth['extra']['first_name']
    user.last_name  = omniauth['extra']['last_name']
    user.email  = omniauth['extra']['email']
    user.is_student  = omniauth['extra']['student']
    user.is_teacher  = omniauth['extra']['teacher']
    user.is_management  = omniauth['extra']['management']
    user.is_admin  = omniauth['extra']['admin']
    user.token = omniauth['credentials']['token']
    user.save
---
SELECT  "users".* FROM "users"  WHERE "users"."uid" = '86' LIMIT 1
INSERT INTO "users" ("uid", "first_name", "last_name", "email", "is_student", "is_teacher", "is_management", "is_admin", "token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "token" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["token", "e664dce546ac829ab2afbc18e50de073"], ["updated_at", "2015-03-07 10:21:04.138170"]]

  def edit_profile

    nume = params[:last_name]
    prenume = params[:first_name]
    email = params[:email]
    iban = params[:iban]
    banca = params[:bank]
    bi_serie = params[:bi_serie]
    bi_numar = params[:bi_numar]

    user = current_user
    body = Hash.new()

    if nume != ""
      user.update_attributes(:last_name => nume)
---
UPDATE "users" SET "iban" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["iban", "ROINGB111222333444"], ["updated_at", "2015-03-14 15:19:12.069282"], ["id", 3]]